In [2]:
# Import dependencies
import sqlite3
import pandas as pd
import numpy as np
from numpy import nan

In [3]:
# Connect to database
conn = sqlite3.connect('database.sqlite')

In [4]:
# Read sqlite query results into a pandas DataFrame
dmgp_df = pd.read_sql_query('SELECT * from demography_table',conn)
dmgp_df.head()

   index Geography Gender             age  population
0      0   Alabama   male   Under_5_years      149374
1      1   Alabama   male    5_to_9_years      153526
2      2   Alabama   male  10_to_14_years      157478
3      3   Alabama   male  15_to_19_years      161735
4      4   Alabama   male  20_to_24_years      166366

In [5]:
# Read sqlite query results into a pandas DataFrame
coordinate_df = pd.read_sql_query('SELECT * from coordinate_table',conn)
coordinate_df.head()

   index State   Latitude   Longitude        City
0      0    AL  32.601011  -86.680736     Alabama
1      1    AK  61.302501 -158.775020      Alaska
2      2    AZ  34.168219 -111.930907     Arizona
3      3    AR  34.751928  -92.131378    Arkansas
4      4    CA  37.271875 -119.270415  California

In [6]:
# Read sqlite query results into a pandas DataFrame
total_dmgp_df = pd.read_sql_query("""SELECT 
State,
Latitude,
Longitude,

Gender,
age,
population

FROM demography_table a
join coordinate_table b 
on a.Geography = b.City
""",conn)

total_dmgp_df.head()

  State   Latitude  Longitude Gender             age  population
0    AL  32.601011 -86.680736   male   Under_5_years      149374
1    AL  32.601011 -86.680736   male    5_to_9_years      153526
2    AL  32.601011 -86.680736   male  10_to_14_years      157478
3    AL  32.601011 -86.680736   male  15_to_19_years      161735
4    AL  32.601011 -86.680736   male  20_to_24_years      166366

# The Greatest Generation & The Silent Generation: Age 73 - 108

In [6]:
# Read sqlite query results into a pandas DataFrame
# greatest_and_silent_df = pd.read_sql_query("""SELECT 
# Geography as City,
# (Both_Sexes_Total_70_to_74_years_2017 + Both_Sexes_Total_75_to_79_years_2017 + Both_Sexes_Total_80_to_84_years_2017 + Both_Sexes_Total_85_years_and_over_2017) as total_greatest_and_silent,
# (Male_Total_70_to_74_years_2017 + Male_Total_75_to_79_years_2017 + Male_Total_80_to_84_years_2017 + Male_Total_85_years_and_over_2017) as male_greatest_and_silent,
# (Female_Total_70_to_74_years_2017 + Female_Total_75_to_79_years_2017 + Female_Total_80_to_84_years_2017 + Female_Total_85_years_and_over_2017) as female_greatest_and_silent
# FROM demography_table 
# """,conn)

# greatest_and_silent_df.head()

# Baby Boomer Generation: Age 54 - 74

In [7]:
# Read sqlite query results into a pandas DataFrame
# baby_boomer_df = pd.read_sql_query("""SELECT 
# Geography as City,
# (Both_Sexes_Total_55_to_59_years_2017 + Both_Sexes_Total_60_to_64_years_2017 + Both_Sexes_Total_60_to_64_years_2017 + Both_Sexes_Total_65_to_69_years_2017 + Both_Sexes_Total_70_to_74_years_2017) as total_baby_boomer,
# (Male_Total_55_to_59_years_2017 + Male_Total_60_to_64_years_2017 + Male_Total_60_to_64_years_2017 + Male_Total_65_to_69_years_2017 + Male_Total_70_to_74_years_2017) as male_baby_boomer,
# (Female_Total_55_to_59_years_2017 + Female_Total_60_to_64_years_2017 + Female_Total_60_to_64_years_2017 + Female_Total_65_to_69_years_2017 + Female_Total_70_to_74_years_2017) as female_baby_boomer
# FROM coordinate_table a 
# inner join demography_table b
# on a.City = b.Geography
# """,conn)

# baby_boomer_df.head()

# Generation X (Baby Bust): Age 39 - 53

In [8]:
# Read sqlite query results into a pandas DataFrame
# gen_x_df = pd.read_sql_query("""SELECT 
# Geography as City,
# (Both_Sexes_Total_40_to_44_years_2017 + Both_Sexes_Total_45_to_49_years_2017 + Both_Sexes_Total_50_to_54_years_2017) as total_gen_x,
# (Male_Total_40_to_44_years_2017 + Male_Total_45_to_49_years_2017 + Male_Total_50_to_54_years_2017) as male_gen_x,
# (Female_Total_40_to_44_years_2017 + Female_Total_45_to_49_years_2017 + Female_Total_50_to_54_years_2017) as female_gen_x
# FROM demography_table 
# """,conn)

# gen_x_df.head()

# Xennials: Age 33 - 43

In [9]:
# Read sqlite query results into a pandas DataFrame
# xennials_df = pd.read_sql_query("""SELECT 
# Geography as City,
# (Both_Sexes_Total_35_to_39_years_2017 + Both_Sexes_Total_40_to_44_years_2017) as total_xennials,
# (Male_Total_35_to_39_years_2017 + Male_Total_40_to_44_years_2017) as male_xennials,
# (Female_Total_35_to_39_years_2017 + Female_Total_40_to_44_years_2017) as female_xennials
# FROM demography_table
# """,conn)

# xennials_df.head()

# Millennials (Generation Y, Gen Next): Age 24 - 38

In [10]:
# Read sqlite query results into a pandas DataFrame
# millennials_df = pd.read_sql_query("""SELECT 
# Geography as City,
# (Both_Sexes_Total_25_to_29_years_2017 + Both_Sexes_Total_30_to_34_years_2017 + Both_Sexes_Total_35_to_39_years_2017) as total_millennials,
# (Male_Total_25_to_29_years_2017 + Male_Total_30_to_34_years_2017 + Male_Total_35_to_39_years_2017) as male_millennials,
# (Female_Total_25_to_29_years_2017 + Female_Total_30_to_34_years_2017 + Female_Total_35_to_39_years_2017) as female_millennials
# FROM demography_table
# """,conn)

# millennials_df.head()

# iGen / Gen Z & Gen Alpha: Age Under 23

In [11]:
# Read sqlite query results into a pandas DataFrame
# gen_z_df = pd.read_sql_query("""SELECT 
# Geography as City,
# (Both_Sexes_Total_Under_5_years_2017 + Both_Sexes_Total_5_to_9_years_2017 + Both_Sexes_Total_10_to_14_years_2017 + Both_Sexes_Total_15_to_19_years_2017 + Both_Sexes_Total_20_to_24_years_2017) as total_gen_z,
# (Male_Total_Under_5_years_2017 + Male_Total_5_to_9_years_2017 + Male_Total_10_to_14_years_2017 + Male_Total_15_to_19_years_2017 + Male_Total_20_to_24_years_2017) as male_gen_zs,
# (Female_Total_Under_5_years_2017 + Female_Total_5_to_9_years_2017 + Female_Total_10_to_14_years_2017 + Female_Total_15_to_19_years_2017 + Female_Total_20_to_24_years_2017) as female_gen_z
# FROM demography_table 
# """,conn)

# gen_z_df.head()

In [7]:
# Save query result to csv file
total_dmgp_df.to_csv("clean_data\clean_demography_data.csv", encoding='utf-8')